Sorry, can not reproduce... 

## Step 1:
```hcl
resource "microsoft365wp_windows_driver_update_profile" "manual" {
  display_name = "TF Test Manual"

  approval_type = "manual"

  #assignments = [
  #  { target = { group = { group_id = "94156df2-f9a0-48d8-918d-7ace3ed8f6f8" } } },
  #]
}
````

Result:
```
OpenTofu will perform the following actions:

  # microsoft365wp_windows_driver_update_profile.manual will be created
  + resource "microsoft365wp_windows_driver_update_profile" "manual" {
      + approval_type           = "manual"
      + assignments             = []
      + created_date_time       = (known after apply)
      + device_reporting        = (known after apply)
      + display_name            = "TF Test Manual"
      + driver_inventories      = (known after apply)
      + id                      = (known after apply)
      + inventory_sync_status   = (known after apply)
      + last_modified_date_time = (known after apply)
      + new_updates             = (known after apply)
      + role_scope_tag_ids      = [
          + "0",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.
microsoft365wp_windows_driver_update_profile.manual: Creating...
microsoft365wp_windows_driver_update_profile.manual: Creation complete after 0s [id=a75fee0f-...]
```

## Step 2:

```hcl
resource "microsoft365wp_windows_driver_update_profile" "manual" {
  display_name = "TF Test Manual"

  approval_type = "manual"

  assignments = [
    { target = { group = { group_id = "94156df2-..." } } },
  ]
}
```

Result
```
OpenTofu will perform the following actions:

  # microsoft365wp_windows_driver_update_profile.manual will be updated in-place
  ~ resource "microsoft365wp_windows_driver_update_profile" "manual" {
      ~ assignments             = [
          + {
              + target = {
                  + filter_type = "none"
                  + group       = {
                      + group_id = "94156df2-...."
                    }
                }
            },
        ]
        id                      = "a75fee0f-...."
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
microsoft365wp_windows_driver_update_profile.manual: Modifying... [id=a75fee0f-...]
microsoft365wp_windows_driver_update_profile.manual: Modifications complete after 0s [id=a75fee0f-...]
```

It seems to work so far. Do you have more input? Otherwise I would attribute this to a one-time fluke in EntraID and close the issue.